In [1]:
import pandas as pd
%load_ext sql

In [2]:
sd = pd.read_csv('healthcare-dataset-stroke-data.csv')
sd.head()

,gender,age,hypertension,Heart disease,Ever married,Work type,Residence type,Avg glucose level,bmi,Smoking status,stroke
0,Male,67.0,0,1,Yes,Private,Urban,228.69,36.6,formerly,smoked
1,Female,61.0,0,0,Yes,Self-employed,Rural,202.21,NaN,never,smoked
2,Male,80.0,0,1,Yes,Private,Rural,105.92,32.5,never,smoked
3,Female,49.0,0,0,Yes,Private,Urban,171.23,34.4,smokes,1
4,Female,79.0,1,0,Yes,Self-employed,Rural,174.12,24.0,never,smoked

In [4]:
%sql postgresql://postgres:password@localhost:5432/postgres

In [30]:
%sql SELECT * FROM infarto LIMIT 5

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[('Male', Decimal('67.00'), '0', '1', 'Yes', 'Private', 'Urban', Decimal('228.69'), '36.6', 'formerly', 'smoked'),
 ('Female', Decimal('61.00'), '0', '0', 'Yes', 'Self-employed', 'Rural', Decimal('202.21'), 'N/A', 'never', 'smoked'),
 ('Male', Decimal('80.00'), '0', '1', 'Yes', 'Private', 'Rural', Decimal('105.92'), '32.5', 'never', 'smoked'),
 ('Female', Decimal('49.00'), '0', '0', 'Yes', 'Private', 'Urban', Decimal('171.23'), '34.4', 'smokes', '1'),
 ('Female', Decimal('79.00'), '1', '0', 'Yes', 'Self-employed', 'Rural', Decimal('174.12'), '24', 'never', 'smoked')]

In [18]:
%sql SELECT ever_married, COUNT(*) AS count FROM infarto GROUP BY ever_married

 * postgresql://postgres:***@localhost:5432/postgres
2 rows affected.

[('No', 1757), ('Yes', 3353)]

In [23]:
%sql SELECT DISTINCT smoking_status FROM infarto

 * postgresql://postgres:***@localhost:5432/postgres
4 rows affected.

[('smokes',), ('never',), ('Unknown',), ('formerly',)]

In [29]:
%sql SELECT COUNT(*) FROM infarto WHERE smoking_status = 'smokes'

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(789,)]

In [28]:
%sql select * from infarto where avg_glucose_level > 250 and age > 70

 * postgresql://postgres:***@localhost:5432/postgres
10 rows affected.

[('Male', Decimal('80.00'), '0', '1', 'Yes', 'Self-employed', 'Urban', Decimal('252.72'), '30.5', 'formerly', 'smoked'),
 ('Male', Decimal('80.00'), '0', '0', 'Yes', 'Private', 'Rural', Decimal('259.63'), '31.7', 'smokes', '1'),
 ('Female', Decimal('71.00'), '0', '0', 'Yes', 'Govt_job', 'Urban', Decimal('263.32'), '38.7', 'never', 'smoked'),
 ('Male', Decimal('81.00'), '1', '1', 'Yes', 'Private', 'Urban', Decimal('250.89'), '28.1', 'smokes', '1'),
 ('Female', Decimal('74.00'), '0', '0', 'Yes', 'Govt_job', 'Urban', Decimal('251.99'), '25.5', 'never', 'smoked'),
 ('Female', Decimal('82.00'), '0', '0', 'Yes', 'Private', 'Urban', Decimal('253.16'), '47.5', 'Unknown', '0'),
 ('Female', Decimal('77.00'), '0', '0', 'Yes', 'Private', 'Urban', Decimal('250.80'), '32.9', 'never', 'smoked'),
 ('Female', Decimal('76.00'), '0', '0', 'Yes', 'Self-employed', 'Urban', Decimal('267.61'), '27.9', 'smokes', '0'),
 ('Male', Decimal('76.00'), '1', '0', 'Yes', 'Private', 'Rural', Decimal('267.60'), '30.5', 'never', 'smoked'),
 ('Female', Decimal('79.00'), '0', '0', 'No', 'Private', 'Urban', Decimal('253.86'), '28.8', 'formerly', 'smoked')]

In [21]:
%sql SELECT AVG(age) AS media_edades FROM infarto

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(Decimal('43.2266144814090020'),)]

In [13]:
%sql SELECT gender, Residence_type, COUNT(*) AS count FROM infarto GROUP BY gender, Residence_type ORDER BY count DESC

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[('Female', 'Urban', 1529),
 ('Female', 'Rural', 1465),
 ('Male', 'Urban', 1067),
 ('Male', 'Rural', 1048),
 ('Other', 'Rural', 1)]